---
kind: other
id: Properties.T:Autodesk.Revit.DB.IFC.HostObjectSubcomponentInfo
source: html/4d097f00-1cc5-edf7-3ea1-4c61c74d4a1e.htm
---
# HostObjectSubcomponentInfo Properties

The area of the CurveLoop of the roof or floor slab.